# Titanic Clustering

## 概要：


## Result:


Reference: 
1. https://www.kaggle.com/c/titanic#tutorials
2. https://www.kaggle.com/sinakhorami/titanic-best-working-classifier
3. https://www.kaggle.com/arthurtok/introduction-to-ensembling-stacking-in-python/notebook

## 1. Preprocess

### Import pkgs

In [1]:
import os
import time

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split, KFold
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.preprocessing import MinMaxScaler
from IPython.display import display

%matplotlib inline

random_state = 258

### Import original data as DataFrame

In [2]:
data_train = pd.read_csv('./input/train.csv')
data_test = pd.read_csv('./input/test.csv')

display(data_train.head(2))
display(data_test.head(2))
data_train.loc[2, 'Ticket']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

'STON/O2. 3101282'

### Show columns of dataframe

In [3]:
data_train_original_col = data_train.columns
data_test_original_col = data_test.columns
print(data_train_original_col)
print(data_test_original_col)
# data_train0 = data_train.drop(data_train_original_col, axis = 1)
# data_test0  = data_test.drop(data_test_original_col, axis = 1)
# display(data_train0.head(2))
# display(data_test0.head(2))

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### Preprocess features

In [4]:
full_data = [data_train, data_test]

In [5]:
# Pclass
for dataset in full_data:
    temp = dataset[dataset['Pclass'].isnull()]
    if len(temp) == 0:
        print('Do not have null value!')
    else:
        temp.head(2)
        
for dataset in full_data:
    dataset['a_Pclass'] = dataset['Pclass']
#     display(dataset.head())

Do not have null value!
Do not have null value!

In [6]:
# Name
for dataset in full_data:
    dataset['a_Name_Length'] = dataset['Name'].apply(len)
#     display(dataset.head(2))

In [7]:
# Sex
for dataset in full_data:
    dataset['a_Sex'] = dataset['Sex'].map({'female': 0, 'male': 1}).astype(int)
#     display(dataset.head(2))

In [8]:
# Age
def is_child(age):
    if age >= 0 and age <=15:
        return 1
    return 0

for dataset in full_data:
    dataset['a_Age'] = dataset['Age'].fillna(-1)
    dataset['a_Have_Age'] = dataset['Age'].isnull().map({True: 0, False: 1}).astype(int)
    dataset['a_Is_Child'] = dataset['a_Age'].apply(is_child)
#     display(dataset[dataset['Age'].isnull()].head(2))
    display(dataset[dataset['Age']<=15].head(2))
    display(dataset.head(2))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,3,30,1,2.0,1,1
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,2,35,0,14.0,1,1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,3,23,1,22.0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,51,0,38.0,1,0

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S,3,26,1,14.0,1,1
21,913,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,NaN,S,3,25,1,9.0,1,1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,3,16,1,34.5,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,3,32,0,47.0,1,0

In [9]:
# SibSp and Parch
for dataset in full_data:
    dataset['a_FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1
    dataset['a_IsAlone'] = dataset['a_FamilySize'].apply(lambda x: 1 if x<=1 else 0)
#     display(dataset.head(2))

In [10]:
# Ticket(Very one have a ticket)
for dataset in full_data:
    dataset['a_Have_Ticket'] = dataset['Ticket'].isnull().map({True: 0, False: 1}).astype(int)
#     display(dataset[dataset['Ticket'].isnull()].head(2))
#     display(dataset.head(2))

In [11]:
# Fare
for dataset in full_data:
    dataset['a_Fare'] = dataset['Fare'].fillna(-1)
    dataset['a_Have_Fare'] = dataset['Fare'].isnull().map({True: 0, False: 1}).astype(int)
#     display(dataset[dataset['Fare'].isnull()].head(2))
#     display(dataset.head(2))

In [12]:
# Cabin
for dataset in full_data:
    dataset['a_Have_Cabin'] = dataset['Cabin'].isnull().map({True: 0, False: 1}).astype(int)
#     display(dataset[dataset['Cabin'].isnull()].head(2))
#     display(dataset.head(2))

In [13]:
# Embarked
for dataset in full_data:
#     dataset['Embarked'] = dataset['Embarked'].fillna('N')
    dataset['a_Embarked'] = dataset['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2, None: 3} ).astype(int)
    dataset['a_Have_Embarked'] = dataset['Embarked'].isnull().map({True: 0, False: 1}).astype(int)
#     display(dataset[dataset['Embarked'].isnull()].head(2))
#     display(dataset.head(2))

Name words segmentation and one-hote

In [14]:
# Name words segmentation
import re
name_words = []

# Inorder to allign columns of data_train and data_test, only data_train to fetch word
for name in data_train['Name']:
#     print(name)
    words = re.findall(r"[\w']+", name)
#     print(len(words))
#     print(words)
    for w in words:
        if w not in name_words:
            name_words.append(w)
# print(len(name_words))
name_words.sort()
# print(name_words)

In [15]:
# Add columns
for dataset in full_data:
    for w in name_words:
        col_name = 'a_Name_' + w
        dataset[col_name] = 0
    dataset.head(1)

In [16]:
# Name words one-hote
for dataset in full_data:
    for i, row in dataset.iterrows():
    #     print(row['Name'])
        words = re.findall(r"[\w']+", row['Name'])
        for w in words:
            if w in name_words:
                col_name = 'a_Name_' + w
                dataset.loc[i, col_name] = 1
#     display(dataset[dataset['a_Name_Braund'] == 1])

Cabin segmentation and one-hote

In [17]:
# Get cabin segmentation words
import re
cabin_words = []

# Inorder to allign columns of data_train and data_test, only data_train to fetch number
for c in data_train['Cabin']:
#     print(c)
    if c is not np.nan:
        word = re.findall(r"[a-zA-Z]", c)
#         print(words[0])
        cabin_words.append(word[0])
print(len(cabin_words))
cabin_words.sort()
print(np.unique(cabin_words))
cabin_words_unique = list(np.unique(cabin_words))

204
['A' 'B' 'C' 'D' 'E' 'F' 'G' 'T']

In [18]:
def get_cabin_word(cabin):
    if cabin is not np.nan:
        word = re.findall(r"[a-zA-Z]", cabin)
        if word:
            return cabin_words_unique.index(word[0])
    return -1

for dataset in full_data:
    dataset['a_Cabin_Word'] = dataset['Cabin'].apply(get_cabin_word)
    # dataset['a_Cabin_Word'].head(100)

In [19]:
def get_cabin_number(cabin):
    if cabin is not np.nan:
        word = re.findall(r"[0-9]+", cabin)
        if word:
            return int(word[0])
    return -1

for dataset in full_data:
    dataset['a_Cabin_Number'] = dataset['Cabin'].apply(get_cabin_number)
    # dataset['a_Cabin_Number'].head(100)

In [20]:
# Clean data
# Reference: 
#    1. https://www.kaggle.com/sinakhorami/titanic-best-working-classifier
#    2. https://www.kaggle.com/arthurtok/introduction-to-ensembling-stacking-in-python/notebook
# full_data = [data_train, data_test]
# for dataset in full_data:
#     dataset['a_Name_length'] = dataset['Name'].apply(len)
#     #dataset['Sex'] = (dataset['Sex']=='male').astype(int)
#     dataset['a_Sex'] = dataset['Sex'].map( {'female': 0, 'male': 1} ).astype(int)
#     dataset['a_Age'] = dataset['Age'].fillna(0)
#     dataset['a_Age_IsNull'] = dataset['Age'].isnull()
#     dataset['a_FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1
#     dataset['a_IsAlone'] = dataset['a_FamilySize'].apply(lambda x: 1 if x<=1 else 0)
#     dataset['a_Fare'] = dataset['Fare'].fillna(dataset['Fare'].median())
#     #dataset['Has_Cabin'] = dataset['Cabin'].apply(lambda x: 1 if type(x) == str else 0) # same as below
#     dataset['a_Has_Cabin'] = dataset['Cabin'].apply(lambda x: 0 if type(x) == float else 1)
#     dataset['a_Has_Embarked'] = dataset['Embarked'].isnull()
#     dataset['Embarked'] = dataset['Embarked'].fillna('N')
#     dataset['a_Embarked'] = dataset['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2, 'N': 3} ).astype(int)
#     dataset['Embarked'] = dataset['Embarked'].fillna('S')
    
# display(data_train.head(2))
# display(data_test.head(2))

In [21]:
survived = data_train['Survived']
data_train0 = data_train.drop(data_train_original_col, axis = 1)
data_test0  = data_test.drop(data_test_original_col, axis = 1)
display(data_train0.head(2))
display(data_test0.head(2))

features = data_train0
display(features.head(2))

,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child,a_FamilySize,a_IsAlone,a_Have_Ticket,a_Fare,...,a_Name_de,a_Name_del,a_Name_der,a_Name_hoef,a_Name_of,a_Name_the,a_Name_van,a_Name_y,a_Cabin_Word,a_Cabin_Number
0,3,23,1,22.0,1,0,2,0,1,7.2500,...,0,0,0,0,0,0,0,0,-1,-1
1,1,51,0,38.0,1,0,2,0,1,71.2833,...,0,0,0,0,0,0,0,0,2,85

,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child,a_FamilySize,a_IsAlone,a_Have_Ticket,a_Fare,...,a_Name_de,a_Name_del,a_Name_der,a_Name_hoef,a_Name_of,a_Name_the,a_Name_van,a_Name_y,a_Cabin_Word,a_Cabin_Number
0,3,16,1,34.5,1,0,1,1,1,7.8292,...,0,0,0,0,0,0,0,0,-1,-1
1,3,32,0,47.0,1,0,2,0,1,7.0000,...,0,0,0,0,0,0,0,0,-1,-1

,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child,a_FamilySize,a_IsAlone,a_Have_Ticket,a_Fare,...,a_Name_de,a_Name_del,a_Name_der,a_Name_hoef,a_Name_of,a_Name_the,a_Name_van,a_Name_y,a_Cabin_Word,a_Cabin_Number
0,3,23,1,22.0,1,0,2,0,1,7.2500,...,0,0,0,0,0,0,0,0,-1,-1
1,1,51,0,38.0,1,0,2,0,1,71.2833,...,0,0,0,0,0,0,0,0,2,85

Check and confirm all columns is proccessed

In [22]:
for col in features.columns:
    if not col.startswith('a_'):
        print(col)

In [23]:
# Shuffle and split the train_data into train, crossvalidation and testing subsets
x_train, x_val, y_train, y_val = train_test_split(features, survived, test_size=0.2, random_state=random_state)

In [24]:
# Show distribute of abave data sets
print(x_train.shape)
print(x_val.shape)
print(y_train.shape)
print(y_val.shape)
display(x_train.head(2))
display(y_train.head(2))

(712, 1545)
(179, 1545)
(712,)
(179,)

,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child,a_FamilySize,a_IsAlone,a_Have_Ticket,a_Fare,...,a_Name_de,a_Name_del,a_Name_der,a_Name_hoef,a_Name_of,a_Name_the,a_Name_van,a_Name_y,a_Cabin_Word,a_Cabin_Number
499,3,18,1,24.0,1,0,1,1,1,7.7958,...,0,0,0,0,0,0,0,0,-1,-1
884,3,22,1,25.0,1,0,1,1,1,7.0500,...,0,0,0,0,0,0,0,0,-1,-1

499    0
884    0
Name: Survived, dtype: int64

## 2. Clustering

In [37]:
from sklearn.cluster import *

In [43]:
clf = KMeans()
y_train_pred = clf.fit_predict(x_train)
print(y_train_pred.shape)
set_y_train_pred = list(set(y_train_pred))
print(set_y_train_pred)
print(y_train_pred[:20])

(712,)
[0, 1, 2, 3, 4, 5, 6, 7]
[6 6 0 6 0 6 5 7 6 3 7 3 6 5 7 0 0 0 7 0]

In [49]:
centers = {}
for i in set_y_train_pred:
    centers[i] = []
for i, central in enumerate(y_train_pred):
    centers[central].append(i)

print(centers[0])
print(centers[1])

centers_labels = {}
for central in centers.keys():
    cen_labels = centers[central]
    print('--', y_train[cen_labels])
#     n = cen_labels.count(0)
#     label = 0
#     if n < len(cen_labels):
#         print(n, len(cen_labels))
#         label = 1
#     centers_labels[central] = label
print(centers_labels.items())

[2, 4, 15, 16, 17, 19, 30, 38, 46, 50, 52, 54, 57, 59, 60, 69, 72, 77, 78, 82, 83, 88, 94, 97, 104, 112, 116, 118, 119, 120, 126, 127, 128, 129, 131, 132, 133, 139, 152, 156, 163, 167, 168, 169, 170, 171, 178, 183, 189, 190, 193, 196, 199, 201, 209, 216, 220, 221, 226, 232, 238, 243, 246, 254, 256, 258, 270, 275, 288, 295, 301, 302, 304, 310, 315, 324, 328, 336, 339, 345, 354, 356, 358, 359, 361, 364, 365, 368, 377, 378, 379, 381, 389, 397, 398, 405, 409, 411, 414, 419, 421, 422, 425, 437, 439, 440, 444, 450, 453, 459, 463, 480, 490, 491, 495, 496, 504, 506, 507, 510, 522, 530, 541, 543, 544, 547, 559, 563, 571, 579, 580, 582, 586, 587, 596, 597, 603, 605, 608, 610, 614, 617, 620, 622, 626, 633, 634, 636, 639, 640, 643, 644, 649, 651, 654, 658, 665, 666, 671, 675, 677, 679, 686, 688, 689, 691, 698, 699, 701, 709]
[53, 55, 64, 107, 151, 153, 160, 162, 187, 212, 253, 263, 276, 279, 284, 292, 298, 306, 314, 352, 362, 374, 380, 383, 393, 400, 404, 447, 449, 457, 471, 487, 498, 531, 542, 599, 616, 637, 638, 646, 678, 685, 694, 703, 706]
-- 2      1.0
4      0.0
15     NaN
16     NaN
17     1.0
19     NaN
30     0.0
38     0.0
46     0.0
50     NaN
52     1.0
54     0.0
57     0.0
59     0.0
60     0.0
69     0.0
72     0.0
77     0.0
78     1.0
82     1.0
83     0.0
88     1.0
94     NaN
97     1.0
104    0.0
112    0.0
116    0.0
118    0.0
119    0.0
120    0.0
      ...
614    0.0
617    0.0
620    0.0
622    1.0
626    0.0
633    0.0
634    0.0
636    0.0
639    NaN
640    NaN
643    1.0
644    1.0
649    1.0
651    1.0
654    0.0
658    0.0
665    0.0
666    0.0
671    0.0
675    0.0
677    1.0
679    1.0
686    0.0
688    0.0
689    NaN
691    NaN
698    0.0
699    0.0
701    1.0
709    1.0
Name: Survived, Length: 170, dtype: float64
-- 53     1.0
55     1.0
64     0.0
107    1.0
151    1.0
153    0.0
160    NaN
162    0.0
187    1.0
212    0.0
253    0.0
263    0.0
276    0.0
279    NaN
284    0.0
292    0.0
298    NaN
306    NaN
314    NaN
352    NaN
362    0.0
374    0.0
380    1.0
383    1.0
393    1.0
400    NaN
404    0.0
447    1.0
449    NaN
457    1.0
471    NaN
487    0.0
498    0.0
531    0.0
542    0.0
599    1.0
616    NaN
637    0.0
638    NaN
646    0.0
678    0.0
685    0.0
694    0.0
703    NaN
706    1.0
Name: Survived, dtype: float64
-- 20     0.0
44     1.0
71     0.0
164    0.0
219    0.0
317    0.0
343    NaN
402    0.0
403    NaN
446    1.0
485    0.0
557    0.0
568    NaN
575    NaN
598    NaN
619    NaN
693    0.0
Name: Survived, dtype: float64
-- 9      1.0
11     1.0
25     NaN
33     NaN
37     0.0
39     NaN
47     1.0
67     0.0
86     0.0
117    0.0
123    1.0
140    0.0
143    0.0
147    0.0
166    1.0
172    NaN
177    0.0
188    NaN
191    0.0
200    0.0
204    1.0
205    0.0
217    NaN
227    0.0
230    1.0
234    0.0
242    0.0
244    0.0
248    NaN
261    1.0
      ...
373    0.0
388    0.0
412    1.0
424    0.0
430    1.0
431    1.0
454    NaN
474    0.0
479    1.0
481    0.0
486    1.0
499    0.0
508    0.0
517    0.0
523    NaN
533    1.0
561    NaN
569    1.0
577    NaN
583    NaN
585    1.0
601    0.0
612    1.0
613    NaN
630    NaN
642    0.0
645    1.0
650    0.0
655    NaN
663    0.0
Name: Survived, Length: 74, dtype: float64
-- 29     0
483    1
692    1
Name: Survived, dtype: int64
-- 6      NaN
13     0.0
95     NaN
99     0.0
108    0.0
121    0.0
124    NaN
158    0.0
173    NaN
194    1.0
206    0.0
208    1.0
249    0.0
271    1.0
291    1.0
297    0.0
410    0.0
489    NaN
494    NaN
505    0.0
521    0.0
537    1.0
600    NaN
621    1.0
684    NaN
687    0.0
Name: Survived, dtype: float64
-- 0      0.0
1      1.0
3      1.0
5      NaN
8      1.0
12     0.0
21     1.0
22     1.0
24     0.0
26     NaN
28     1.0
34     0.0
36     NaN
42     0.0
43     1.0
45     0.0
49     NaN
56     1.0
58     1.0
62     0.0
63     NaN
65     1.0
68     1.0
70     0.0
73     0.0
74     1.0
75     0.0
80     0.0
85     NaN
87     0.0
      ...
607    1.0
609    1.0
618    1.0
625    NaN
627    NaN
629    NaN
631    NaN
647    1.0
653    1.0
656    0.0
657    NaN
661    0.0
662    NaN
668    0.0
669    1.0
670    NaN
672    0.0
673    1.0
674    0.0
681    1.0
683    0.0
690    1.0
695    0.0
696    NaN
697    1.0
700    1.0
702    0.0
705    0.0
708    NaN
711    NaN
Name: Survived, Length: 243, dtype: float64
-- 7      0.0
10     1.0
14     0.0
18     0.0
23     1.0
27     0.0
31     NaN
32     1.0
35     0.0
40     0.0
41     0.0
48     0.0
51     0.0
61     1.0
66     1.0
76     0.0
79     1.0
81     1.0
84     1.0
90     NaN
93     0.0
98     1.0
106    NaN
109    1.0
111    NaN
115    0.0
130    0.0
138    0.0
144    0.0
148    0.0
      ...
572    NaN
574    NaN
576    1.0
578    0.0
584    0.0
590    NaN
591    1.0
592    0.0
602    0.0
604    1.0
611    0.0
615    1.0
623    0.0
624    NaN
628    0.0
632    1.0
635    1.0
641    1.0
648    0.0
652    NaN
659    0.0
660    NaN
664    1.0
667    NaN
676    0.0
680    0.0
682    0.0
704    0.0
707    1.0
710    1.0
Name: Survived, Length: 134, dtype: float64
dict_items([])

### Predict and Export pred.csv file

In [28]:
train_cols = data_train.columns
for col in data_test0.columns:
    if col not in train_cols:
        print(col)

In [29]:
project_name = 'Titanic'
step_name = 'StatML_vote'
time_str = time.strftime("%Y%m%d_%H%M%S", time.localtime())
final_acc_str = str(int(y_pred_vote_soft_score*10000))
run_name = project_name + '_' + step_name + '_' + time_str + '_' + final_acc_str
print(run_name)
cwd = os.getcwd()
pred_file = os.path.join(cwd, 'output', run_name + '.csv')
print(pred_file)

Titanic_StatML_vote_20171229_213921_8491
D:\Kaggle\Titanic_Machine_Learning_From_Disaster\output\Titanic_StatML_vote_20171229_213921_8491.csv

In [30]:
display(data_test0.head(2))
y_data_pred = gs_vote_soft.predict(data_test0.as_matrix())
print(y_data_pred.shape)
y_data_pred = np.squeeze(y_data_pred)
print(y_data_pred.shape)
y_data_pred = (y_data_pred > 0.5).astype(int)
print(y_data_pred)

print(data_test['PassengerId'].shape)
passenger_id = data_test['PassengerId']
output = pd.DataFrame( { 'PassengerId': passenger_id , 'Survived': y_data_pred })

output.to_csv(pred_file , index = False)

,a_Pclass,a_Name_Length,a_Sex,a_Age,a_Have_Age,a_Is_Child,a_FamilySize,a_IsAlone,a_Have_Ticket,a_Fare,...,a_Name_de,a_Name_del,a_Name_der,a_Name_hoef,a_Name_of,a_Name_the,a_Name_van,a_Name_y,a_Cabin_Word,a_Cabin_Number
0,3,16,1,34.5,1,0,1,1,1,7.8292,...,0,0,0,0,0,0,0,0,-1,-1
1,3,32,0,47.0,1,0,2,0,1,7.0000,...,0,0,0,0,0,0,0,0,-1,-1

(418,)
(418,)
[0 0 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 0 0 0 1 1 0 1 0 1 0 1 0 0 0 1 1 0 0 0
 0 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 0 1 1 0 1 1 1 0 0 1
 1 0 0 1 0 1 1 0 0 0 0 0 1 0 1 1 1 0 1 0 0 0 1 0 0 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 0 1 1 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
 0 0 1 0 0 1 0 0 1 1 1 1 1 1 1 0 0 1 0 0 1 0 0 0 0 0 0 1 1 0 1 1 0 1 1 0 1
 0 1 0 0 0 0 0 1 0 1 0 1 0 0 0 0 1 0 1 0 0 1 0 1 0 0 0 0 1 0 1 1 0 1 0 1 0
 1 0 1 1 0 1 0 0 0 1 0 0 0 0 0 0 1 1 1 1 1 0 1 1 1 0 1 1 1 0 0 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 0 0 1 0 1 0 0 1 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 1 0 1 0 0
 1 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 1 0
 1 0 0 0 0 0 1 0 0 0 1 1 1 0 0 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 1 0 0 1 0 1 0 0 1 0 1 0 0 1 0
 0 1 1 1 1 1 0 1 0 0 1]
(418,)

In [31]:
print(preds_sm)
print(run_name)
print('Done!')

{'AdaBoostClassifier': 0.84916201117318435, 'RandomForestClassifier': 0.84357541899441346, 'GradientBoostingClassifier': 0.85474860335195535, 'KNeighborsClassifier': 0.73184357541899436, 'DecisionTreeClassifier': 0.85474860335195535}
Titanic_StatML_vote_20171229_213921_8491
Done!